app/controllers/users_controller.rb

  def index
    #@users = User.order("lower(name) ASC").all.paginate(page: params[:page])
	#@users = User.order("lower(uin) ASC").all.paginate(page: params[:page])
	@sorting = params[:sort]
	    User.order( @sorting ? @sorting : :id).each do |mv|
            (@users ||= [ ]) << mv
		end
		@users = User.order(@sorting).all.paginate(page: params[:page])
		@teams = {}

		@users.each do |user|
			res = Relationship.find_by_user_id(user.id)
			if res!=nil
			print(res.inspect)
				@teams[user.id] =  Team.find_by_id(res.team_id)
---
SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."user_id" = ? LIMIT 1  [["user_id", 762146111], ["user_id", 762146111]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 762146111]]

  def show
		print("Params = " + params.to_s())
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1046959424]]